using System;

// Делегат для выбора способа сортировки
delegate void Sort(int[] a);

class Program
{
    // Сортировка пузырьком
    static void Bubble(int[] a)
    {
        // Перебор массив по порядку до предпоследнего элемента  
        for (int i = 0; i < a.Length - 1; i++)
        {
            // Перебор элементы массива по очереди, начиная с первого
            for (int j = 0; j < a.Length - 1; j++)
            {
                // Если левое число больше правого
                if (a[j] > a[j + 1])
                {
                    // Меняем числа местами
                    int x = a[j];
                    a[j] = a[j + 1]; // на место первого поставить второе число
                    a[j + 1] = x; // на место второго поставить сохранённое первое число
                }
            }
        }
    }

    // Сортировка выбором
    static void Select(int[] a)
    {
        // Перебор массив по порядку до предпоследнего элемента  
        for (int i = 0; i < a.Length - 1; i++)
        {
            // Сравнение текущего элемента с последующими
            for (int j = i + 1; j < a.Length; j++)
            {
                // Если текущий элемент больше следующего
                if (a[i] > a[j])
                {
                    // Меняем числа местами
                    int x = a[i];
                    a[i] = a[j];
                    a[j] = x;
                }
            }
        }
    }

    static void Main()
    {
        // Создание массива чисел
        int[] a = { 8, 3, 6, 1, 9, 2, 5 };

        // Вывод исходных чисел
        Console.WriteLine("Числа:");

        // Сравнение текущего элемента с последующими
        for (int i = 0; i < a.Length; i++)
            Console.Write(a[i] + " ");

        // Цикл для повторного выбора сортировки
        while (true)
        {
            // Вывод меню
            Console.WriteLine("\n\n1 - Пузырьком");
            Console.WriteLine("2 - Выбором");
            Console.WriteLine("0 - Выход");
            Console.Write("Выбор: ");

            // Ввод выбора пользователя
            string choice = Console.ReadLine();

            // Завершение программы
            if (choice == "0")
                break;

            // Переменная для выбранного метода сортировки
            Sort sort;

            // Выбор сортировки пузырьком
            if (choice == "1")
                sort = Bubble;

            // Выбор сортировки выбором
            else if (choice == "2")
                sort = Select;

            // Проверка неправильного выбора
            else
            {
                Console.WriteLine("Ошибка!");
                continue;
            }

            // Запуск выбранной сортировки
            sort(a);

            // Вывод отсортированного массива
            Console.WriteLine("\nРезультат:");

            // Сравнение текущего элемента с последующими
            for (int i = 0; i < a.Length; i++)
                Console.Write(a[i] + " ");
        }
    }
}